Repository: eeexception/mafia_game_bot
Catalog: lib/l10n/app_*.arb
Languages: ru

# appTitle
source: Mafia Party Game
ru: Мафия

source: GAME SETUP
ru: НАСТРОЙКА ИГРЫ

# playersConnected
source: {count} Players Connected
ru: Подключено игроков: {count}

# rolesAndMechanics
source: ROLES & MECHANICS
ru: РОЛИ И МЕХАНИКИ

source: Commissar Role
ru: Роль Комиссара

# commissarSubtitle
source: Town investigator (Rec: 3+ players)
ru: Следователь города (Рекомендуется: 3+ игрока)

source: Doctor Role
ru: Роль Доктора

# doctorSubtitle
source: Town healer (Rec: 4+ players)
ru: Лекарь города (Рекомендуется: 4+ игрока)

source: Doctor Can Heal Self
ru: Доктор может лечить себя

source: Allow Consecutive Healing
ru: Разрешить последовательное лечение

# allowConsecutiveHealingSubtitle
source: Can heal same player twice in a row
ru: Можно лечить одного игрока два хода подряд

source: Prostitute Role
ru: Роль Проститутки

# prostituteSubtitle
source: Blocks night actions (Rec: 5+ players)
ru: Блокирует ночные действия (Рекомендуется: 5+ игроков)

source: Maniac Role
ru: Роль Маньяка

# maniacSubtitle
source: Neutral killer (Rec: 9+ players)
ru: Нейтральный убийца (Рекомендуется: 9+ игроков)

source: Sergeant Role
ru: Роль Сержанта

# sergeantSubtitle
source: Commissar helper (Rec: 6+ players)
ru: Помощник комиссара (Рекомендуется: 6+ игроков)

source: Lawyer Role
ru: Роль Адвоката

# lawyerSubtitle
source: Mafia investigator (Rec: 7+ players)
ru: Следователь мафии (Рекомендуется: 7+ игроков)

source: Poisoner Role
ru: Роль Отравителя

# poisonerSubtitle
source: Neutral trap role (Rec: 8+ players)
ru: Нейтральная роль с ловушками (Рекомендуется: 8+ игроков)

source: GAME MECHANICS
ru: МЕХАНИКА ИГРЫ

# autoPruning
source: Auto-pruning Roles
ru: Автоматическое сокращение ролей

# autoPruningSubtitle
source: Automatically skip roles if player count is too low
ru: Пропускать роли, если недостаточно игроков

source: Don Mechanics
ru: Механика Дона

# donMechanicsSubtitle
source: Mafia leader controls the kill (Rec: 3+ players)
ru: Лидер мафии управляет убийством (Рекомендуется: 3+ игрока)

# commissarKills
source: Commissar Can Kill
ru: Комиссар может убивать

# commissarKillsSubtitle
source: Commissar shoots instead of checking
ru: Комиссар стреляет вместо проверки

source: Discussion
ru: Обсуждение

source: Voting
ru: Голосование

source: Defense
ru: Защита

source: Mafia Action
ru: Ход мафии

# timers
source: TIMERS (Seconds)
ru: ТАЙМЕРЫ (Секунды)

# themeAndVoiceActing
source: THEME & VOICE ACTING
ru: ТЕМА И ОЗВУЧКА

source: READY TO START?
ru: ГОТОВЫ НАЧАТЬ?

source: DISTRIBUTE ROLES
ru: РАСПРЕДЕЛИТЬ РОЛИ

source: Need at least 3 players
ru: Нужно минимум 3 игрока

source: by {author}
ru: от {author}

source: Language
ru: Язык

source: Russian
ru: Русский

source: START GAME
ru: НАЧАТЬ ИГРУ

source: Waiting for players...
ru: Ожидание игроков...

source: Mafia
ru: Мафия

source: Civilian
ru: Мирный житель

source: Doctor
ru: Доктор

source: Prostitute
ru: Проститутка

source: Commissar
ru: Комиссар

source: Maniac
ru: Маньяк

source: Sergeant
ru: Сержант

source: Lawyer
ru: Адвокат

source: Poisoner
ru: Отравитель

source: Scan to Join
ru: Сканируйте, чтобы подключиться

source: Connected Players: {count}
ru: Подключено игроков: {count}

# totalPlayersRegistered
source: ({count} total players registered)
ru: ({count} всего зарегистрировано)

source: Remove disconnected player
ru: Удалить отключенного игрока

source: VIEW STATISTICS
ru: ПРОСМОТР СТАТИСТИКИ

source: SETUP GAME
ru: НАСТРОЙКА ИГРЫ

# audioNotFound
source: ⚠️ AUDIO NOT FOUND: {path}
ru: ⚠️ АУДИОФАЙЛ НЕ НАЙДЕН: {path}

source: STOP GAME?
ru: ОСТАНОВИТЬ ИГРУ?

# stopGameConfirm
source: Are you sure you want to stop the game? This will reveal all roles.
ru: Вы уверены, что хотите остановить игру? Все роли будут раскрыты.

source: CANCEL
ru: ОТМЕНА

source: STOP
ru: СТОП

source: PAUSED
ru: ПАУЗА

# phaseLobby
source: Lobby
ru: Лобби

# phaseSetup
source: Setup
ru: Настройка

# phaseRoleReveal
source: Role Reveal
ru: Распределение ролей

# phaseNightMafia
source: Night: Mafia
ru: Ночь: Мафия

# phaseNightProstitute
source: Night: Prostitute
ru: Ночь: Проститутка

# phaseNightManiac
source: Night: Maniac
ru: Ночь: Маньяк

# phaseNightDoctor
source: Night: Doctor
ru: Ночь: Доктор

# phaseNightPoisoner
source: Night: Poisoner
ru: Ночь: Отравитель

# phaseNightCommissar
source: Night: Commissar
ru: Ночь: Комиссар

# phaseMorning
source: Morning
ru: Утро

# phaseDayDiscussion
source: Day: Discussion
ru: День: Обсуждение

# phaseDayVoting
source: Day: Voting
ru: День: Голосование

# phaseDayDefense
source: Day: Defense
ru: День: Оправдательная речь

# phaseDayVerdict
source: Day: Verdict
ru: День: Вердикт

# phaseGameOver
source: Game Over
ru: Конец игры

source: RESUME (SPACE)
ru: ПРОДОЛЖИТЬ (SPACE)

source: PAUSE (SPACE)
ru: ПАУЗА (SPACE)

source: STOP GAME (ESC)
ru: ОСТАНОВИТЬ ИГРУ (ESC)

source: ADVANCE PHASE
ru: СЛЕДУЮЩАЯ ФАЗА

# gamePausedLarge
source: GAME PAUSED
ru: ИГРА НА ПАУЗЕ

# judgingPlayer
source: JUDGING PLAYER {number}
ru: СУД НАД ИГРОКОМ {number}

source: EXECUTE
ru: КАЗНИТЬ

source: PARDON
ru: ПОМИЛОВАТЬ

source: VOTES CAST
ru: ГОЛОСОВ ПОДАНО

source: REMAINING
ru: ОСТАЛОСЬ

source: EVENT LOG
ru: ЖУРНАЛ СОБЫТИЙ

source: ELIMINATED
ru: ВЫБЫЛ

source: VOTES: {count}
ru: ГОЛОСОВ: {count}

# votingFor
source: VOTING FOR #{number}
ru: ГОЛОСУЕТ ПРОТИВ #{number}

source: NICKNAME
ru: НИКНЕЙМ

source: ROLE
ru: РОЛЬ

source: STATUS
ru: СТАТУС

source: ALIVE
ru: ЖИВ

source: NEW GAME (KEEP PLAYERS)
ru: НОВАЯ ИГРА (ТЕ ЖЕ ИГРОКИ)

source: EXIT TO MAIN MENU
ru: ВЫХОД В ГЛАВНОЕ МЕНЮ

source: EXPORT LOG
ru: ЭКСПОРТ ЛОГА

# logExportedTo
source: Log exported to: {path}
ru: Лог экспортирован в: {path}

source: Failed to export log
ru: Не удалось экспортировать лог

# errorLoadingThemes
source: Error loading themes: {error}
ru: Ошибка при загрузке тем: {error}

source: GAME STATISTICS
ru: ИГРОВАЯ СТАТИСТИКА

source: TOTAL GAMES PLAYED
ru: ВСЕГО ИГР ПРОВЕДЕНО

source: TOWN WINS
ru: ПОБЕД ГОРОДА

source: MAFIA WINS
ru: ПОБЕД МАФИИ

source: MANIAC WINS
ru: ПОБЕД МАНЬЯКА

source: RESET ALL STATISTICS
ru: СБРОСИТЬ ВСЮ СТАТИСТИКУ

source: RESULTS VIEWING
ru: ПРОСМОТР РЕЗУЛЬТАТОВ

# fallAsleep
source: FALL ASLEEP (DONE)
ru: ЗАСНУТЬ (ГОТОВО)

source: ACTION CONFIRMED
ru: ДЕЙСТВИЕ ПОДТВЕРЖДЕНО

source: Waiting for others...
ru: Ожидание остальных...

source: DON KILL ACTION
ru: ХОД ДОНА (УБИЙСТВО)

# donSearch
source: DON SEARCH (SEARCH FOR COMMISSAR)
ru: ПОИСК ДОНА (ИЩЕТ КОМИССАРА)

source: MAFIA TEAM VOTE
ru: ГОЛОСОВАНИЕ КОМАНДЫ МАФИИ

# lawyerInvestigation
source: LAWYER INVESTIGATION (SEARCH ACTIVE TOWN)
ru: РАССЛЕДОВАНИЕ АДВОКАТА (ИЩЕТ АКТИВНЫХ ГОРОЖАН)

# poisonerAction
source: POISONER ACTION (DELAYED KILL)
ru: ХОД ОТРАВИТЕЛЯ (ОТЛОЖЕННОЕ УБИЙСТВО)

# doctorAction
source: DOCTOR ACTION (HEAL)
ru: ХОД ДОКТОРА (ЛЕЧЕНИЕ)

source: COMMISSAR ACTION (KILL)
ru: ХОД КОМИССАРА (УБИЙСТВО)

# commissarActionInvestigate
source: COMMISSAR/SERGEANT ACTION (INVESTIGATE)
ru: ХОД КОМИССАРА/СЕРЖАНТА (ПРОВЕРКА)

# cityIsSleeping
source: THE CITY IS SLEEPING...
ru: ГОРОД ЗАСЫПАЕТ...
